Terraform plan for __staging__
<details>
  <summary>Plan: 13 to add, 6 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_user_policy_attachment.eks-admin-policy will be created
  + resource "aws_iam_user_policy_attachment" "eks-admin-policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + user       = "ssb-eks-broker"
    }

  # aws_iam_user_policy_attachment.eks-broker-policy will be created
  + resource "aws_iam_user_policy_attachment" "eks-broker-policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + user       = "ssb-eks-broker"
    }

  # aws_iam_user_policy_attachment.smtp-admin-policy will be created
  + resource "aws_iam_user_policy_attachment" "smtp-admin-policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + user       = "ssb-smtp-broker"
    }

  # aws_iam_user_policy_attachment.smtp-broker-policy will be created
  + resource "aws_iam_user_policy_attachment" "smtp-broker-policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "ssb-smtp-broker"
    }

  # module.broker_eks.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
      ~ environment          = (sensitive value)
        id                   = "3c172cdb-005d-4865-bac7-fef743e231ad"
      ~ id_bg                = "************************************" -> (known after apply)
        name                 = "ssb-eks"
        # (16 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management-staging"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
        id                               = "1b91bff2-130f-41d5-8295-574780d974ec"
        name                             = "ssb-eks-gsa-datagov-management-staging"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ password                         = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # module.broker_smtp.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
      ~ environment          = (sensitive value)
        id                   = "cf549fb0-d041-43d6-84b2-8b6f00232a6c"
      ~ id_bg                = "************************************" -> (known after apply)
        name                 = "ssb-smtp"
        # (16 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management-staging"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
        id                               = "f9a995bb-0e83-4382-b3e0-a4f08b2b9c38"
        name                             = "ssb-smtp-gsa-datagov-management-staging"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ password                         = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # module.broker_solr.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
      + docker_image               = ""
      ~ environment                = (sensitive value)
      + health_check_http_endpoint = ""
        id                         = "cef393cc-3e58-456b-89b8-44fe37f144c7"
        name                       = "ssb-solr"
        # (17 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }

  # module.broker_solr.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management-staging"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "66366778-3eea-4220-b584-443d60cf203d"
        name                             = "ssb-solr-gsa-datagov-management-staging"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ password                         = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # module.iam_assumable_roles.aws_iam_role.admin[0] will be created
  + resource "aws_iam_role" "admin" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + Bool            = {
                              + aws:MultiFactorAuthPresent = [
                                  + "true",
                                ]
                            }
                          + NumericLessThan = {
                              + aws:MultiFactorAuthAge = [
                                  + "86400",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = "arn:aws:iam::133032889584:root"
                          + Service = []
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SSBAdmin"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.iam_assumable_roles.aws_iam_role.poweruser[0] will be created
  + resource "aws_iam_role" "poweruser" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + Bool            = {
                              + aws:MultiFactorAuthPresent = [
                                  + "true",
                                ]
                            }
                          + NumericLessThan = {
                              + aws:MultiFactorAuthAge = [
                                  + "86400",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = "arn:aws:iam::133032889584:root"
                          + Service = []
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SSBDev"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.iam_assumable_roles.aws_iam_role_policy_attachment.admin[0] will be created
  + resource "aws_iam_role_policy_attachment" "admin" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "SSBAdmin"
    }

  # module.iam_assumable_roles.aws_iam_role_policy_attachment.poweruser[0] will be created
  + resource "aws_iam_role_policy_attachment" "poweruser" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/PowerUserAccess"
      + role       = "SSBDev"
    }

  # module.smtp_broker_policy.aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "SMTP broker policy (covers SES, Route53, etc)"
      + id          = (known after apply)
      + name        = "smtp_broker"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ses:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.ssb-eks-broker-user.aws_iam_access_key.this_no_pgp[0] will be created
  + resource "aws_iam_access_key" "this_no_pgp" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "ssb-eks-broker"
    }

  # module.ssb-eks-broker-user.aws_iam_user.this[0] will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "ssb-eks-broker"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # module.ssb-smtp-broker-user.aws_iam_access_key.this_no_pgp[0] will be created
  + resource "aws_iam_access_key" "this_no_pgp" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "ssb-smtp-broker"
    }

  # module.ssb-smtp-broker-user.aws_iam_user.this[0] will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "ssb-smtp-broker"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

Plan: 13 to add, 6 to change, 0 to destroy.
```
</details>

Plan generated in [plan #107](https://github.com/GSA/datagov-ssb/actions/runs/1106599508)